get.txt
20        Threads
50        Connections per thread
20000     Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets            0.00          ---          ---      0.00000         0.00 
Gets       100428.75       100.37    100328.38     10.35400      2646.80 
Waits           0.00          ---          ---      0.00000          --- 
Totals     100428.75       100.37    100328.38     10.35400      2646.80 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       0.250         0.00
GET       0.260         0.00
GET       0.270         0.00
GET       0.280         0.00
GET       0.290         0.00
GET       0.300         0.00
GET       0.310         0.00
GET       0.320         0.00
GET       0.330         0.00
GET       0.340         0.00
GET       0.350         0.00
GET       0.360         0.00
GET       0.370         0.00
GET       0.380         0.00
GET       0.390         0.00
GET       0.400         0.01
GET       0.410         0.01
GET       0.420         0.01
GET       0.430         0.01
GET       0.440         0.01
GET       0.450         0.01
GET       0.460         0.01
GET       0.470         0.01
GET       0.480         0.01
GET       0.490         0.01
GET       0.500         0.01
GET       0.510         0.01
GET       0.520         0.01
GET       0.530         0.01
GET       0.540         0.01
GET       0.550         0.01
GET       0.560         0.01
GET       0.570         0.01
GET       0.580         0.01
GET       0.590         0.02
GET       0.600         0.02
GET       0.610         0.02
GET       0.620         0.02
GET       0.630         0.02
GET       0.640         0.02
GET       0.650         0.02
GET       0.660         0.02
GET       0.670         0.02
GET       0.680         0.02
GET       0.690         0.02
GET       0.700         0.02
GET       0.710         0.02
GET       0.720         0.02
GET       0.730         0.02
GET       0.740         0.02
GET       0.750         0.02
GET       0.760         0.03
GET       0.770         0.03
GET       0.780         0.03
GET       0.790         0.03
GET       0.800         0.03
GET       0.810         0.03
GET       0.820         0.03
GET       0.830         0.03
GET       0.840         0.03
GET       0.850         0.03
GET       0.860         0.03
GET       0.870         0.03
GET       0.880         0.03
GET       0.890         0.03
GET       0.900         0.03
GET       0.910         0.03
GET       0.920         0.03
GET       0.930         0.03
GET       0.940         0.04
GET       0.950         0.04
GET       0.960         0.04
GET       0.970         0.04
GET       0.980         0.04
GET       0.990         0.04
GET       1.000         0.04
GET       1.100         0.05
GET       1.200         0.07
GET       1.300         0.08
GET       1.400         0.09
GET       1.500         0.10
GET       1.600         0.11
GET       1.700         0.13
GET       1.800         0.14
GET       1.900         0.15
GET       2.000         0.15
GET       2.100         0.16
GET       2.200         0.17
GET       2.300         0.18
GET       2.400         0.19
GET       2.500         0.22
GET       2.600         0.30
GET       2.700         0.44
GET       2.800         0.54
GET       2.900         0.60
GET       3.000         0.64
GET       3.100         0.69
GET       3.200         0.73
GET       3.300         0.77
GET       3.400         0.80
GET       3.500         0.83
GET       3.600         0.86
GET       3.700         0.89
GET       3.800         0.92
GET       3.900         0.94
GET       4.000         0.96
GET       4.100         0.98
GET       4.200         1.00
GET       4.300         1.02
GET       4.400         1.04
GET       4.500         1.06
GET       4.600         1.08
GET       4.700         1.11
GET       4.800         1.15
GET       4.900         1.23
GET       5.000         1.43
GET       5.100         1.76
GET       5.200         2.22
GET       5.300         2.82
GET       5.400         3.47
GET       5.500         4.13
GET       5.600         4.85
GET       5.700         5.63
GET       5.800         6.44
GET       5.900         7.23
GET       6.000         7.94
GET       6.100         8.53
GET       6.200         9.00
GET       6.300         9.38
GET       6.400         9.69
GET       6.500         9.98
GET       6.600        10.30
GET       6.700        10.68
GET       6.800        11.02
GET       6.900        11.27
GET       7.000        11.46
GET       7.100        11.62
GET       7.200        11.77
GET       7.300        11.92
GET       7.400        12.12
GET       7.500        12.38
GET       7.600        12.67
GET       7.700        12.98
GET       7.800        13.31
GET       7.900        13.63
GET       8.000        13.94
GET       8.100        14.20
GET       8.200        14.42
GET       8.300        14.63
GET       8.400        14.83
GET       8.500        15.05
GET       8.600        15.27
GET       8.700        15.49
GET       8.800        15.74
GET       8.900        16.04
GET       9.000        16.42
GET       9.100        16.90
GET       9.200        17.47
GET       9.300        18.15
GET       9.400        18.97
GET       9.500        19.94
GET       9.600        21.11
GET       9.700        22.49
GET       9.800        24.17
GET       9.900        26.10
GET      10.000        42.91
GET      11.000        79.86
GET      12.000        91.51
GET      13.000        95.13
GET      14.000        96.84
GET      15.000        98.07
GET      16.000        99.13
GET      17.000        99.59
GET      18.000        99.77
GET      19.000        99.86
GET      20.000        99.91
GET      21.000        99.93
GET      22.000        99.94
GET      23.000        99.95
GET      24.000        99.95
GET      25.000        99.95
GET      26.000        99.96
GET      27.000        99.96
GET      28.000        99.96
GET      29.000        99.96
GET      30.000        99.97
GET      31.000        99.97
GET      32.000        99.97
GET      33.000        99.97
GET      34.000        99.97
GET      35.000        99.97
GET      36.000        99.97
GET      37.000        99.97
GET      38.000        99.97
GET      39.000        99.98
GET      40.000        99.98
GET      41.000        99.98
GET      42.000        99.98
GET      43.000        99.98
GET      44.000        99.98
GET      45.000        99.98
GET      46.000        99.98
GET      47.000        99.98
GET      48.000        99.98
GET      49.000        99.98
GET      50.000        99.98
GET      51.000        99.98
GET      52.000        99.98
GET      53.000        99.99
GET      54.000        99.99
GET      55.000        99.99
GET      56.000        99.99
GET      57.000        99.99
GET      58.000        99.99
GET      59.000        99.99
GET      60.000        99.99
GET      61.000        99.99
GET      62.000        99.99
GET      63.000       100.00
GET      64.000       100.00
GET      65.000       100.00
GET      66.000       100.00
GET      67.000       100.00
GET      68.000       100.00
GET      69.000       100.00
GET      70.000       100.00
GET      71.000       100.00
GET      72.000       100.00
GET      73.000       100.00
GET      74.000       100.00
GET      75.000       100.00
GET      76.000       100.00
GET      77.000       100.00
GET      78.000       100.00
GET      79.000       100.00
GET      80.000       100.00
GET      81.000       100.00
GET      82.000       100.00
GET      83.000       100.00
GET      84.000       100.00
GET      85.000       100.00
GET      86.000       100.00
GET      87.000       100.00
GET      88.000       100.00
GET      89.000       100.00
GET      90.000       100.00
GET      91.000       100.00
GET      92.000       100.00
GET      93.000       100.00
GET      94.000       100.00
GET      95.000       100.00
GET      96.000       100.00
GET      97.000       100.00
GET      98.000       100.00
GET      99.000       100.00
GET     100.000       100.00
GET     110.000       100.00
GET     120.000       100.00
GET     130.000       100.00
---
~/memtier_benchmark/memtier_benchmark -c 50 --key-maximum=20000000 --protocol=memcache_text --key-minimum=1 --data-size=512 --server=10.33.46.113 --threads=20 --key-pattern=P:P --ratio=0:1 --requests=20000 --port=11333